package com.kh.OopEx;
/*
 객체 
 	캡슐화 : GetterSetter 실제 상세는 숨기고 외부에서접근하면서 원본은 유지하되
 			원본을 복사해서 밖에서만 수정하고 수정한내용을 반환할수 있도록
 	상속 : extends 사용해서 부모클래스를 물려받아 자식클래스에 맞게끔수정한 클래스 
 	다형성 : 상속과 연관이 깊음 부모클래스에서 물려받은 자식클래스가 다시 정의를 내려 메서드나 필드를사용
 	추상화 : abstract 희미하게 완성하지않은 메서드를 완성할 수 있게 클래스에서 다시 작성하는걸 의미
 	인터페이스: implement 객체가 아니기떄문에 객체에서 사용을 할수있고 인터페이스의 경우 
 	상속을 여러개 받을때 사용
 
 
 클래스 : 데이터와 해당 데이터를 처리하기위한 행동들의 집합 
 자바에서 클래스는 객체를 만들기위한 공간 
 클래스 이름은 파일명과 일치해야함 
 클래스 이름에는 규칙이있음 
 첫글자를 대문자로 작성할경우 외부에서 파일을 사용가능하다라는 표시 
 첫글자를 소문자로 작성할경우 외부에서 파일을 사용할수없다는 표시 
 
 
 */
public class 객체 {

	
	
	
	
	
}
